app/views/payments/index.html.erb

							<img src="<%= plot.thumb_image %>" alt="..." class="img-thumbnail img-check">
							<input type="radio" name="chk1" id="item<%= plot.sequence %>" value="Plot size<%= plot.size %>sq.ft and Rs.<%= plot.amount %> L" class="hidden" autocomplete="off" required>
---
SELECT "plot_sizes".* FROM "plot_sizes"