app/controllers/homes_controller.rb

INSERT INTO "homes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-05-17 04:31:38.071799"], ["updated_at", "2018-05-17 04:31:38.071799"]]
---
  def create
    @home = Home.new(home_params)

    respond_to do |format|
      if @home.save

SELECT  "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_home
      @home = Home.find(params[:id])