app/controllers/homes_controller.rb

  def create
    @home = Home.new(home_params)

    respond_to do |format|
      if @home.save
---
INSERT INTO "homes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-05-18 11:10:01.709685"], ["updated_at", "2018-05-18 11:10:01.709685"]]

    def set_home
      @home = Home.find(params[:id])
---
SELECT  "homes".* FROM "homes" WHERE "homes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]