app/controllers/payments_controller.rb

SELECT "plot_sizes".* FROM "plot_sizes"
---
  def index
    @plots = PlotSize.all