app/controllers/payments_controller.rb

SELECT  "user_details".* FROM "user_details" WHERE "user_details"."id" = $1 LIMIT $2  [["id", 37], ["LIMIT", 1]]
---
  def requestHandler
    @user = UserDetail.find(params[:id])