app/controllers/user_details_controller.rb

def new
	@plots = PlotSize.all
---
SELECT "plot_sizes".* FROM "plot_sizes"

def create
	# binding.pry
	@user_detail = UserDetail.new(user_detail_params)
	# binding.pry
	if @user_detail.save
---
INSERT INTO "user_details" ("name", "email", "number", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", ""], ["email", ""], ["number", 12123], ["created_at", "2018-05-15 11:31:40.895220"], ["updated_at", "2018-05-15 11:31:40.895220"]]